data/Section 5/5.2/Client/VM1_Instance2/rep2/output_C2_T1_W64_K6_R2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       39690 ops,     442 (avg:     440) ops/sec, 1.57MB/sec (avg: 1.57MB/sec),  4.53 (avg:  4.52) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         220.49          ---          ---      4.50800       228.98
Gets         220.47      1322.83         0.00      4.53300      1376.38
Waits          0.00          ---          ---      0.00000          ---
Totals       440.97      1322.83         0.00      4.52100      1605.36


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.400         0.01
SET       1.500         0.03
SET       1.600         0.15
SET       1.700         0.50
SET       1.800         1.38
SET       1.900         2.93
SET       2.000         5.21
SET       2.100         7.93
SET       2.200        11.51
SET       2.300        15.38
SET       2.400        19.12
SET       2.500        23.10
SET       2.600        26.34
SET       2.700        29.71
SET       2.800        32.66
SET       2.900        35.31
SET       3.000        37.85
SET       3.100        40.05
SET       3.200        42.09
SET       3.300        44.00
SET       3.400        45.71
SET       3.500        47.28
SET       3.600        48.77
SET       3.700        50.24
SET       3.800        51.64
SET       3.900        52.93
SET       4.000        54.04
SET       4.100        55.18
SET       4.200        56.32
SET       4.300        57.71
SET       4.400        58.93
SET       4.500        60.17
SET       4.600        61.34
SET       4.700        62.56
SET       4.800        63.79
SET       4.900        65.02
SET       5.000        66.30
SET       5.100        67.44
SET       5.200        68.65
SET       5.300        69.75
SET       5.400        71.11
SET       5.500        72.35
SET       5.600        73.53
SET       5.700        74.83
SET       5.800        76.10
SET       5.900        77.33
SET       6.000        78.66
SET       6.100        79.72
SET       6.200        80.75
SET       6.300        81.76
SET       6.400        82.74
SET       6.500        83.81
SET       6.600        84.62
SET       6.700        85.60
SET       6.800        86.50
SET       6.900        87.22
SET       7.000        87.92
SET       7.100        88.57
SET       7.200        89.15
SET       7.300        89.71
SET       7.400        90.20
SET       7.500        90.71
SET       7.600        91.16
SET       7.700        91.64
SET       7.800        91.98
SET       7.900        92.39
SET       8.000        92.68
SET       8.100        92.93
SET       8.200        93.17
SET       8.300        93.48
SET       8.400        93.79
SET       8.500        94.08
SET       8.600        94.33
SET       8.700        94.57
SET       8.800        94.83
SET       8.900        95.06
SET       9.000        95.25
SET       9.100        95.48
SET       9.200        95.74
SET       9.300        95.94
SET       9.400        96.09
SET       9.500        96.29
SET       9.600        96.41
SET       9.700        96.56
SET       9.800        96.75
SET       9.900        96.91
SET      10.000        97.42
SET      11.000        98.08
SET      12.000        98.49
SET      13.000        98.84
SET      14.000        99.03
SET      15.000        99.22
SET      16.000        99.44
SET      17.000        99.54
SET      18.000        99.63
SET      19.000        99.70
SET      20.000        99.74
SET      21.000        99.79
SET      22.000        99.81
SET      23.000        99.84
SET      24.000        99.86
SET      25.000        99.89
SET      26.000        99.90
SET      27.000        99.91
SET      28.000        99.92
SET      30.000        99.93
SET      31.000        99.94
SET      33.000        99.94
SET      34.000        99.95
SET      35.000        99.96
SET      36.000        99.97
SET      37.000        99.97
SET      39.000        99.98
SET      53.000        99.98
SET      60.000        99.99
SET      66.000       100.00
---
GET       1.700         0.01
GET       1.800         0.10
GET       1.900         0.48
GET       2.000         1.39
GET       2.100         3.18
GET       2.200         5.82
GET       2.300         9.19
GET       2.400        13.19
GET       2.500        17.55
GET       2.600        21.67
GET       2.700        25.65
GET       2.800        29.57
GET       2.900        32.89
GET       3.000        35.87
GET       3.100        38.69
GET       3.200        41.17
GET       3.300        43.61
GET       3.400        45.58
GET       3.500        47.57
GET       3.600        49.24
GET       3.700        50.83
GET       3.800        52.24
GET       3.900        53.75
GET       4.000        55.04
GET       4.100        56.14
GET       4.200        57.39
GET       4.300        58.46
GET       4.400        59.70
GET       4.500        60.80
GET       4.600        62.09
GET       4.700        63.21
GET       4.800        64.34
GET       4.900        65.55
GET       5.000        66.84
GET       5.100        68.01
GET       5.200        69.10
GET       5.300        70.25
GET       5.400        71.55
GET       5.500        72.72
GET       5.600        74.05
GET       5.700        75.29
GET       5.800        76.47
GET       5.900        77.64
GET       6.000        79.02
GET       6.100        80.30
GET       6.200        81.48
GET       6.300        82.64
GET       6.400        83.78
GET       6.500        84.90
GET       6.600        85.85
GET       6.700        86.82
GET       6.800        87.66
GET       6.900        88.44
GET       7.000        89.17
GET       7.100        89.80
GET       7.200        90.37
GET       7.300        91.03
GET       7.400        91.43
GET       7.500        91.86
GET       7.600        92.30
GET       7.700        92.70
GET       7.800        93.02
GET       7.900        93.28
GET       8.000        93.58
GET       8.100        93.91
GET       8.200        94.18
GET       8.300        94.41
GET       8.400        94.63
GET       8.500        94.78
GET       8.600        95.01
GET       8.700        95.15
GET       8.800        95.35
GET       8.900        95.56
GET       9.000        95.75
GET       9.100        95.90
GET       9.200        96.02
GET       9.300        96.18
GET       9.400        96.34
GET       9.500        96.48
GET       9.600        96.60
GET       9.700        96.78
GET       9.800        96.91
GET       9.900        97.06
GET      10.000        97.75
GET      11.000        98.43
GET      12.000        98.83
GET      13.000        99.05
GET      14.000        99.25
GET      15.000        99.41
GET      16.000        99.52
GET      17.000        99.59
GET      18.000        99.62
GET      19.000        99.67
GET      20.000        99.70
GET      21.000        99.73
GET      22.000        99.76
GET      23.000        99.77
GET      24.000        99.79
GET      25.000        99.80
GET      26.000        99.82
GET      29.000        99.83
GET      30.000        99.83
GET      31.000        99.85
GET      32.000        99.87
GET      35.000        99.90
GET      36.000        99.91
GET      37.000        99.91
GET      40.000        99.93
GET      41.000        99.93
GET      44.000        99.94
GET      49.000        99.94
GET      51.000        99.95
GET      59.000        99.96
GET      64.000        99.96
GET      68.000        99.97
GET      82.000        99.97
GET      93.000        99.99
GET     100.000       100.00
---